 %%%%%%%%%%%%%%%%%%%%%%%%%得到路径索引矩阵P%%%%%%%%%%%%%%%%%%%%%%%%
function [P]=GetPath(L,spcost,R)
% L 路径条数约束     
%spcost 路径距离     
% R 转弯次数递增索引矩阵
% P 路径条数约束条件下选择的路径索引向量

 if(spcost<999)                     %是否为不可达路径
     n = size(R,2);
     if(n>L)                        %如果路径数大于约束条数
%      d = (n-1)/(L-1);             %得到等差值
       d = 1;                       %按转弯次数从小到大依次采取
       b = 1:d:L;                   %在所有路径中（等差）取出路径
%      b = round(b);                %得到取路径数的整数值
       P = R(b);
     else
       P = R;                     %路径数小于路径约束条数不做处理
     end  
 else
      P = 0;
end